#+TITLE: Section 1.3 Exercises

** Solution
#+begin_src scheme
(define tolerance 0.00001)
(define (fixed-point f first-guess)
  (define (close-enough? v1 v2)
    (< (abs (- v1 v2))
       tolerance))
  (define (try guess n)
    (display "try #")
    (display n)
    (display ": ")
    (display guess)
    (newline)
    (let ((next (f guess)))
      (if (close-enough? guess next)
          next
          (try next (inc n)))))
  (try first-guess 1))

(define (average x y) (/ (+ x y) 2))

(display "Without average damping")
(newline)
(display (fixed-point
          (lambda (x)
            (/ (log 1000) (log x)))
          10.0))
(newline)

(newline)
(display "With average damping")
(newline)
(display (fixed-point
          (lambda (x)
            (average x (/ (log 1000) (log x))))
          10.0))
(newline)
#+end_src

#+RESULTS:
#+begin_example
Without average damping
try #1: 10.0
try #2: 2.9999999999999996
try #3: 6.2877098228681545
try #4: 3.7570797902002955
try #5: 5.218748919675316
try #6: 4.1807977460633134
try #7: 4.828902657081293
try #8: 4.386936895811029
try #9: 4.671722808746095
try #10: 4.481109436117821
try #11: 4.605567315585735
try #12: 4.522955348093164
try #13: 4.577201597629606
try #14: 4.541325786357399
try #15: 4.564940905198754
try #16: 4.549347961475409
try #17: 4.5596228442307565
try #18: 4.552843114094703
try #19: 4.55731263660315
try #20: 4.554364381825887
try #21: 4.556308401465587
try #22: 4.555026226620339
try #23: 4.55587174038325
try #24: 4.555314115211184
try #25: 4.555681847896976
try #26: 4.555439330395129
try #27: 4.555599264136406
try #28: 4.555493789937456
try #29: 4.555563347820309
try #30: 4.555517475527901
try #31: 4.555547727376273
try #32: 4.555527776815261
try #33: 4.555540933824255
4.555532257016376

With average damping
try #1: 10.0
try #2: 6.5
try #3: 5.095215099176933
try #4: 4.668760681281611
try #5: 4.57585730576714
try #6: 4.559030116711325
try #7: 4.55613168520593
try #8: 4.555637206157649
try #9: 4.55555298754564
try #10: 4.555538647701617
4.555536206185039
#+end_example

*** Recursive
#+begin_src scheme
(define (cont-frac n d k)
  (define (recurse i)
    (if (= i k)
        (/ (n k) (d k))
        (/ (n i) (+ (d i) (recurse (+ i 1))))))
  (recurse 1))

(define (search-k-approx f start target error)
  (if (<
       (abs (- (f start) target))
       error)
  start
  (search-k-approx f (+ start 1) target error)))

(display (search-k-approx
          (lambda (k)
            (cont-frac
             (lambda (i) 1.0)
             (lambda (i) 1.0)
             k))
         3
         0.61803398
         0.0001))
#+end_src

#+RESULTS:
: 10

*** Iterative
#+begin_src scheme
(define (cont-frac n d k)
  (define (iter k result)
    (if (= k 0)
        result
        (iter
         (- k 1)
         (/ (n k)
            (+ (d k) result)))))
  (iter (- k 1) (/ (n k) (d k))))

(define (search-k-approx f start target error)
  (if (<
       (abs (- (f start) target))
       error)
  start
  (search-k-approx f (+ start 1) target error)))

(display
 (search-k-approx
  (lambda (k)
    (cont-frac
     (lambda (i) 1.0)
     (lambda (i) 1.0)
     k))
  3
  0.61803398
  0.0001))
#+end_src

#+RESULTS:
: 10

